/********************************************************************
**版权所有         深圳市几米物联有限公司
**文件名称:        my_verson.h
**文件描述:        版本信息头文件
**当前版本:        V1.0
**作    者:        Harrison Wu (wuyujiao@jimiiot.com)
**完成日期:        2026.01.15
*********************************************************************
** 功能描述:        记录版本信息
*********************************************************************/

#ifndef _MY_VERSION_H_
#define _MY_VERSION_H_

#define SOFTWARE_VERSION "LL311_NRF54L15_V1.0_260115"
/*
** 软件版本:        V1.0
** 完成日期:        2026.01.15
** 作    者:        Harrison Wu (wuyujiao@jimiiot.com)
** 功能描述:        完成初台框架
*/

#endif /* _MY_VERSION_H_ */
