/********************************************************************
**版权所有         深圳市几米物联有限公司
**文件名称:        my_battery.h
**文件描述:        电池管理模块实现头文件
**当前版本:        V1.0
**作    者:        周森达 (zhousenda@jimiiot.com)
**完成日期:        2026.02.04
*********************************************************************/

#ifndef _MY_BATTERY_H_
#define _MY_BATTERY_H_

// 电池状态枚举, 定义了电池的不同状态等级，从空到满
typedef enum
{
    BATT_UNKNOWN = -1,  /* 电池状态未知状态 */
    BATT_EMPTY,         /* 电池电量为空 */
    BATT_LOW,           /* 电池电量低 */
    BATT_NORMAL,        /* 电池电量正常 */
    BATT_FAIR,          /* 电池电量良好 */
    BATT_HIGH,          /* 电池电量高 */
    BATT_FULL,          /* 电池电量满 */
} my_batt_state_t;

// 正常状态 LED 控制结构体, 用于控制电池状态 LED 显示的结构体
typedef struct
{
    struct k_timer *timer;       /* 定时器指针，用于控制 LED 显示的定时 */
    my_batt_state_t state;            /* 当前电池状态，使用枚举类型 */
    uint8_t time_count;          /* 时间计数器，用于控制 LED 闪烁和显示持续时间, 按键按下, LED 执行5s, 定时器设置为100ms , 50次*/
} batt_led_ctrl_t;

// 电源状态枚举, 定义了设备的电源连接状态
typedef enum
{
    CHARG_UNKNOWN = -1,     /* 充电状态未知状态 */
    NO_CHARGING,            /* 充电器未连接 */
    CHARGING,               /* 充电器已连接（充电中） */
    CHARG_FULL,             /* 充电器已连接且电池已充满 */
} my_chg_state_t;

typedef enum
{
    CHG_BATT_LOW,    /* 充电状态电池电量低 */
    CHG_BATT_FAIR,   /* 充电状态电池电量良好 */
    CHG_BATT_HIGH,   /* 充电状态电池电量高 */
    CHG_BATT_FULL,   /* 充电状态电池电量满，电池已充满 */
} my_chg_batt_state_t;

// 充电状态 LED 控制结构体, 用于控制电池状态 LED 显示的结构体
typedef struct
{
    struct k_timer *timer;       /* 定时器指针，用于控制 LED 显示的定时 */
    my_chg_batt_state_t state;            /* 当前电池状态，使用枚举类型 */
    uint16_t time_count;          /* 时间计数器，用于控制 LED 闪烁和显示持续时间以及固定时间(10s)检测更新充电状态,定时器500ms循环*/
} chg_led_ctrl_t;

//电池电压-电量映射结构体,用于存储电池电压值与对应电量百分比的映射关系,用于通过电池电压计算电量百分比.
typedef struct
{
    int32_t mv;       /**< 电池电压值，单位为毫伏 (mV) */
    int8_t percent;   /**< 对应的电池电量百分比，范围为 0-100 */
} batt_volt_percent_map_t;

// 正常状态LED控制结构体，包含定时器、电池状态和计数器
extern batt_led_ctrl_t g_batt_led_ctrl;

// 充电状态LED控制结构体，包含定时器、充电电池状态和计数器
extern chg_led_ctrl_t g_chg_led_ctrl;

// 电源状态，初始值为未连接
extern my_chg_state_t g_charg_state;

int batt_read_mv(int32_t *mv);
int ntc_read_raw(int16_t *raw);
int batt_adc_init(void);
void batt_enable(bool on);
int batt_gpio_init(void);

/*********************************************************************
**函数名称:  show_battary
**入口参数:  无
**出口参数:  无
**函数功能:  显示电池状态
**返 回 值:  无
*********************************************************************/
void my_battery_show(void);

/*********************************************************************
**函数名称:  my_battery_update_state
**入口参数:  无
**出口参数:  无
**函数功能:  检查并更新电池状态
*********************************************************************/
void my_battery_update_state(void);

/*********************************************************************
**函数名称:  my_battery_show_chgled
**入口参数:  无
**出口参数:  无
**函数功能:  检查充电检测引脚的状态，根据检测结果更新充电状态并控制LED显示。
** 如果检测到充电，则启动充电LED控制定时器；如果未检测到充电，则关闭所有电池LED。
*********************************************************************/
void my_battery_show_chgled();

/*********************************************************************
**函数名称:  my_battery_read_mv
**入口参数:  *mv  --  指向存储电池电压值的指针，单位为毫伏
**出口参数:  err  --  错误码，0 表示成功，非 0 表示失败
**函数功能:  读取电池电压值（毫伏）,函数采用多次采样并去除极值的方法提高测量准确性,
**           最终结果会乘以 2，是因为硬件电路中的分压系数
*********************************************************************/
int my_battery_read_mv(int32_t *mv);

/*********************************************************************
**函数名称:  my_battery_pm_register
**入口参数:  无
**出口参数:  无
**函数功能:  将 Battery 模块注册到统一 PM 框架
**返 回 值:  0 表示成功，负值表示失败
*********************************************************************/
int my_battery_pm_register(void);

/*********************************************************************
**函数名称:  get_show_percent
**入口参数:  无
**出口参数:  电池电量百分比
**函数功能:  获取当前电池电量百分比
*********************************************************************/
int8_t get_show_percent(void);

#endif
