/********************************************************************
**版权所有         深圳市几米物联有限公司
**文件名称:        my_motor.h
**文件描述:        电机控制模块实现头文件
**当前版本:        V1.0
**作    者:        周森达 (zhousenda@jimiiot.com)
**完成日期:        2026.02.04
*********************************************************************/

#ifndef _MY_MOTOR_H_
#define _MY_MOTOR_H_

void motor_power_set(bool on);
/********************************************************************
**函数名称:  req_open_lock_action
**入口参数:  无
**出口参数:  无
**函数功能:  请求执行上锁操作
**返 回 值:  无
*********************************************************************/
void req_open_lock_action(void);
/********************************************************************
**函数名称:  req_close_lock_action
**入口参数:  无
**出口参数:  无
**函数功能:  请求执行关锁操作
**返 回 值:  无
*********************************************************************/
void req_close_lock_action(void);
/********************************************************************
**函数名称:  stop_lock_action
**入口参数:  无
**出口参数:  无
**函数功能:  执行停止开/关锁操作
**返 回 值:  无
*********************************************************************/
void stop_lock_action(void);
int motor_gpio_init(void);
/********************************************************************
**函数名称:  get_closelock_state
**入口参数:  无
**出口参数:  无
**函数功能:  获取关锁限位状态
**返 回 值:  true  ---        关锁到位（限位检测到）
            false ---        未关锁到位
*********************************************************************/
bool get_closelock_state(void);
#endif