/********************************************************************
**版权所有         深圳市几米物联有限公司
**文件名称:        my_motor.h
**文件描述:        电机控制模块实现头文件
**当前版本:        V1.0
**作    者:        周森达 (zhousenda@jimiiot.com)
**完成日期:        2026.02.04
*********************************************************************/

#ifndef _MY_MOTOR_H_
#define _MY_MOTOR_H_

typedef enum {
    UNLOCKING,  // 正在开锁
    LOCKING,    // 正在关锁
    LOCK_STOP,  // 停止锁操作
} lock_state_t;

extern lock_state_t g_bBleLockState;
extern lock_state_t g_netLockState;

void motor_power_set(bool on);

/********************************************************************
**函数名称:  req_open_lock_action
**入口参数:  无
**出口参数:  无
**函数功能:  请求执行上锁操作
**返 回 值:  无
*********************************************************************/
void req_open_lock_action(void);

/********************************************************************
**函数名称:  req_close_lock_action
**入口参数:  无
**出口参数:  无
**函数功能:  请求执行关锁操作
**返 回 值:  无
*********************************************************************/
void req_close_lock_action(void);

/********************************************************************
**函数名称:  stop_lock_action
**入口参数:  无
**出口参数:  无
**函数功能:  执行停止开/关锁操作
**返 回 值:  无
*********************************************************************/
void stop_lock_action(void);

int motor_gpio_init(void);

/********************************************************************
**函数名称:  get_closelock_state
**入口参数:  无
**出口参数:  无
**函数功能:  获取关锁限位状态
**返 回 值:  true  ---        关锁到位（限位检测到）
            false ---        未关锁到位
*********************************************************************/
bool get_closelock_state(void);

/********************************************************************
**函数名称:  get_openlock_state
**入口参数:  无
**出口参数:  无
**函数功能:  获取开锁限位状态
**返 回 值:  true  ---        开锁到位（限位检测到）
            false ---        未开锁到位
*********************************************************************/
bool get_openlock_state(void);

/********************************************************************
**函数名称:  respond_netlock_result
**入口参数:  lock_msg_data   ---   需要发送的锁状态结果字符串
**出口参数:  无
**函数功能:  响应网络上锁结果：将结果数据通过消息队列发送给 LTE 模块
**           回复应答4G
**返 回 值:  无
*********************************************************************/
void respond_netlock_result(const char *lock_msg_data);

#endif